espressif/arduino-esp32/libraries/WiFi/src/WiFiGeneric.cpp
const char *WiFiGenericClass::eventName(arduino_event_id_t id) {
  return Network.eventName(id);
}

const char *WiFiGenericClass::getHostname() {
  return NetworkManager::getHostname();
}

bool WiFiGenericClass::setHostname(const char *hostname) {
  return NetworkManager::setHostname(hostname);
}

/**
 * callback for WiFi events
 * @param arg
 */
void WiFiGenericClass::_eventCallback(arduino_event_t *event) {
  if (!event) {
    return;  //Null would crash this function
  }

  // log_d("Arduino Event: %d - %s", event->event_id, WiFi.eventName(event->event_id));
  if (event->event_id == ARDUINO_EVENT_WIFI_SCAN_DONE) {
    WiFiScanClass::_scanDone();
#if !CONFIG_ESP_WIFI_REMOTE_ENABLED
  } else if (event->event_id == ARDUINO_EVENT_SC_GOT_SSID_PSWD) {
    WiFi.begin(
      (const char *)event->event_info.sc_got_ssid_pswd.ssid, (const char *)event->event_info.sc_got_ssid_pswd.password, 0,
      ((event->event_info.sc_got_ssid_pswd.bssid_set == true) ? event->event_info.sc_got_ssid_pswd.bssid : NULL)
    );
  } else if (event->event_id == ARDUINO_EVENT_SC_SEND_ACK_DONE) {
    esp_smartconfig_stop();
    WiFiSTAClass::_smartConfigDone = true;
#endif
  }
}

/**
 * Return the current channel associated with the network
 * @return channel (1-13)
 */
int32_t WiFiGenericClass::channel(void) {
  uint8_t primaryChan = 0;
  wifi_second_chan_t secondChan = WIFI_SECOND_CHAN_NONE;
  if (!lowLevelInitDone) {
    return primaryChan;
  }
  esp_wifi_get_channel(&primaryChan, &secondChan);
  return primaryChan;
}

/**
 * Set the WiFi channel configuration
 * @param primary primary channel. Depending on the region, not all channels may be available.
 * @param secondary secondary channel (WIFI_SECOND_CHAN_NONE, WIFI_SECOND_CHAN_ABOVE, WIFI_SECOND_CHAN_BELOW)
 * @return 0 on success, otherwise error
 */
int WiFiGenericClass::setChannel(uint8_t primary, wifi_second_chan_t secondary) {
  wifi_country_t country;
  esp_err_t ret;

  ret = esp_wifi_get_country(&country);
  if (ret != ESP_OK) {
    log_e("Failed to get country info 0x%x: %s", ret, esp_err_to_name(ret));
    return ret;
  }

  uint8_t min_chan = country.schan;
  uint8_t max_chan = min_chan + country.nchan - 1;

  if (primary < min_chan || primary > max_chan) {
    log_e("Invalid primary channel: %d. Valid range is %d-%d for country %s", primary, min_chan, max_chan, country.cc);
    return ESP_ERR_INVALID_ARG;
  }

  ret = esp_wifi_set_channel(primary, secondary);
  if (ret != ESP_OK) {
    log_e("Failed to set channel 0x%x: %s", ret, esp_err_to_name(ret));
    return ret;
  }

  return ESP_OK;
}

/**
 * store WiFi config in SDK flash area
 * @param persistent
 */
void WiFiGenericClass::persistent(bool persistent) {
  _persistent = persistent;
}

/**
 * enable WiFi long range mode
 * @param enable
 */
void WiFiGenericClass::enableLongRange(bool enable) {
  _long_range = enable;
}

#if CONFIG_SOC_WIFI_HE_SUPPORT
#define WIFI_PROTOCOL_DEFAULT (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AX)
#else
#define WIFI_PROTOCOL_DEFAULT (WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N)
#endif

#if SOC_WIFI_SUPPORT_5G
#if CONFIG_SOC_WIFI_HE_SUPPORT
#define WIFI_PROTOCOL_DEFAULT_5G (WIFI_PROTOCOL_11A | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AC | WIFI_PROTOCOL_11AX)
#else
#define WIFI_PROTOCOL_DEFAULT_5G (WIFI_PROTOCOL_11A | WIFI_PROTOCOL_11N | WIFI_PROTOCOL_11AC)
#endif
#endif

static bool _wifi_is_lr_enabled(wifi_interface_t ifx) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 2) && SOC_WIFI_SUPPORT_5G
  wifi_band_mode_t band_mode = WIFI_BAND_MODE_AUTO;
  esp_err_t err = esp_wifi_get_band_mode(&band_mode);
  if (err != ESP_OK) {
    log_e("Failed to get Current Band Mode: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  if (band_mode == WIFI_BAND_MODE_AUTO) {
    wifi_protocols_t protocols = {.ghz_2g = 0, .ghz_5g = 0};
    err = esp_wifi_get_protocols(ifx, &protocols);
    if (err != ESP_OK) {
      log_e("Failed to get Current Protocols: 0x%x: %s", err, esp_err_to_name(err));
      return false;
    }
    return protocols.ghz_2g == WIFI_PROTOCOL_LR;
  } else if (band_mode == WIFI_BAND_MODE_5G_ONLY) {
    return false;
  }
#endif
  uint16_t protocol_bitmap = 0;
  esp_err_t err2 = esp_wifi_get_protocol(ifx, (uint8_t *)&protocol_bitmap);
  if (err2 != ESP_OK) {
    log_e("Failed to get Current Protocols: 0x%x: %s", err2, esp_err_to_name(err2));
    return false;
  }
  return protocol_bitmap == WIFI_PROTOCOL_LR;
}

static bool _wifi_enable_lr(wifi_interface_t ifx) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 2) && SOC_WIFI_SUPPORT_5G
  wifi_band_mode_t band_mode = WIFI_BAND_MODE_AUTO;
  esp_err_t err = esp_wifi_get_band_mode(&band_mode);
  if (err != ESP_OK) {
    log_e("Failed to get Current Band Mode: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  if (band_mode == WIFI_BAND_MODE_AUTO) {
    wifi_protocols_t protocols = {.ghz_2g = WIFI_PROTOCOL_LR, .ghz_5g = WIFI_PROTOCOL_DEFAULT_5G};
    err = esp_wifi_set_protocols(ifx, &protocols);
    if (err != ESP_OK) {
      log_e("Failed to set LR Protocol: 0x%x: %s", err, esp_err_to_name(err));
      return false;
    }
    return true;
  } else if (band_mode == WIFI_BAND_MODE_5G_ONLY) {
    log_e("LR Protocol can only be enabled on 2.4GHz WiFi");
    return false;
  }
#endif
  esp_err_t err2 = esp_wifi_set_protocol(ifx, WIFI_PROTOCOL_LR);
  if (err2 != ESP_OK) {
    log_e("Failed to set LR Protocol: 0x%x: %s", err2, esp_err_to_name(err2));
    return false;
  }
  return true;
}

static bool _wifi_disable_lr(wifi_interface_t ifx) {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 2) && SOC_WIFI_SUPPORT_5G
  wifi_band_mode_t band_mode = WIFI_BAND_MODE_AUTO;
  esp_err_t err = esp_wifi_get_band_mode(&band_mode);
  if (err != ESP_OK) {
    log_e("Failed to get Current Band Mode: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  if (band_mode == WIFI_BAND_MODE_AUTO) {
    wifi_protocols_t protocols = {.ghz_2g = WIFI_PROTOCOL_DEFAULT, .ghz_5g = WIFI_PROTOCOL_DEFAULT_5G};
    err = esp_wifi_set_protocols(ifx, &protocols);
    if (err != ESP_OK) {
      log_e("Failed to set Default Protocol: 0x%x: %s", err, esp_err_to_name(err));
      return false;
    }
    return true;
  } else if (band_mode == WIFI_BAND_MODE_5G_ONLY) {
    log_e("LR Protocol can only be disabled on 2.4GHz WiFi");
    return false;
  }
#endif
  esp_err_t err2 = esp_wifi_set_protocol(ifx, WIFI_PROTOCOL_DEFAULT);
  if (err2 != ESP_OK) {
    log_e("Failed to set Default Protocol: 0x%x: %s", err2, esp_err_to_name(err2));
    return false;
  }
  return true;
}

/**
 * set new mode
 * @param m WiFiMode_t
 */
bool WiFiGenericClass::mode(wifi_mode_t m) {
  wifi_mode_t cm = getMode();
  if (cm == m) {
    return true;
  }
  if (!cm && m) {
    // Turn ON WiFi
    if (!wifiLowLevelInit(_persistent)) {
      return false;
    }
    Network.onSysEvent(_eventCallback);
  }

  if (((m & WIFI_MODE_STA) != 0) && ((cm & WIFI_MODE_STA) == 0)) {
    // we are enabling STA interface
    WiFi.STA.onEnable();
  }
  if (((m & WIFI_MODE_AP) != 0) && ((cm & WIFI_MODE_AP) == 0)) {
    // we are enabling AP interface
    WiFi.AP.onEnable();
  }

  if (cm && !m) {
    // Turn OFF WiFi
    if (!espWiFiStop()) {
      return false;
    }
    if ((cm & WIFI_MODE_STA) != 0) {
      // we are disabling STA interface
      WiFi.STA.onDisable();
    }
    if ((cm & WIFI_MODE_AP) != 0) {
      // we are disabling AP interface
      WiFi.AP.onDisable();
    }
    Network.removeEvent(_eventCallback);
    return true;
  }

  esp_err_t err;
  if (((m & WIFI_MODE_STA) != 0) && ((cm & WIFI_MODE_STA) == 0)) {
    err = esp_netif_set_hostname(esp_netifs[ESP_IF_WIFI_STA], NetworkManager::getHostname());
    if (err) {
      log_e("Could not set hostname! 0x%x: %s", err, esp_err_to_name(err));
      return false;
    }
  }
  err = esp_wifi_set_mode(m);
  if (err) {
    log_e("Could not set mode! 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }

  if (((m & WIFI_MODE_STA) == 0) && ((cm & WIFI_MODE_STA) != 0)) {
    // we are disabling STA interface (but AP is ON)
    WiFi.STA.onDisable();
  }
  if (((m & WIFI_MODE_AP) == 0) && ((cm & WIFI_MODE_AP) != 0)) {
    // we are disabling AP interface (but STA is ON)
    WiFi.AP.onDisable();
  }

  if (_long_range) {
    if (m & WIFI_MODE_STA) {
      if (!_wifi_enable_lr(WIFI_IF_STA)) {
        log_e("Could not enable long range on STA!");
        return false;
      }
    }
    if (m & WIFI_MODE_AP) {
      if (!_wifi_enable_lr(WIFI_IF_AP)) {
        log_e("Could not enable long range on AP!");
        return false;
      }
    }
  } else {
    if (m & WIFI_MODE_STA) {
      if (_wifi_is_lr_enabled(WIFI_IF_STA)) {
        log_v("Disabling long range on STA");
        if (!_wifi_disable_lr(WIFI_IF_STA)) {
          log_e("Could not disable long range on STA!");
          return false;
        }
      }
    }
    if (m & WIFI_MODE_AP) {
      if (_wifi_is_lr_enabled(WIFI_IF_AP)) {
        log_v("Disabling long range on AP");
        if (!_wifi_disable_lr(WIFI_IF_AP)) {
          log_e("Could not disable long range on AP!");
          return false;
        }
      }
    }
  }
  if (!espWiFiStart()) {
    return false;
  }

