espressif/arduino-esp32/libraries/WiFi/src/WiFiGeneric.cpp
#ifdef BOARD_HAS_DUAL_ANTENNA
  if (!setDualAntennaConfig(ANT1, ANT2, WIFI_RX_ANT_AUTO, WIFI_TX_ANT_AUTO)) {
    log_e("Dual Antenna Config failed!");
    return false;
  }
#endif

  return true;
}

/**
 * get WiFi mode
 * @return WiFiMode
 */
wifi_mode_t WiFiGenericClass::getMode() {
  if (!lowLevelInitDone || !_esp_wifi_started) {
    return WIFI_MODE_NULL;
  }
  wifi_mode_t mode;
  if (esp_wifi_get_mode(&mode) != ESP_OK) {
    log_w("WiFi not started");
    return WIFI_MODE_NULL;
  }
  return mode;
}

/**
 * control STA mode
 * @param enable bool
 * @return ok
 */
bool WiFiGenericClass::enableSTA(bool enable) {

  wifi_mode_t currentMode = getMode();
  bool isEnabled = ((currentMode & WIFI_MODE_STA) != 0);

  if (isEnabled != enable) {
    if (enable) {
      return mode((wifi_mode_t)(currentMode | WIFI_MODE_STA));
    }
    return mode((wifi_mode_t)(currentMode & (~WIFI_MODE_STA)));
  }
  return true;
}

/**
 * control AP mode
 * @param enable bool
 * @return ok
 */
bool WiFiGenericClass::enableAP(bool enable) {

  wifi_mode_t currentMode = getMode();
  bool isEnabled = ((currentMode & WIFI_MODE_AP) != 0);

  if (isEnabled != enable) {
    if (enable) {
      return mode((wifi_mode_t)(currentMode | WIFI_MODE_AP));
    }
    return mode((wifi_mode_t)(currentMode & (~WIFI_MODE_AP)));
  }
  return true;
}

/**
 * Enable or disable WiFi modem power save mode
 * @param enable bool
 * @return ok
 */
bool WiFiGenericClass::setSleep(bool enabled) {
  return setSleep(enabled ? WIFI_PS_MIN_MODEM : WIFI_PS_NONE);
}

/**
 * Set WiFi modem power save mode
 * @param mode wifi_ps_type_t
 * @return ok
 */
bool WiFiGenericClass::setSleep(wifi_ps_type_t sleepType) {
  if (sleepType > WIFI_PS_MAX_MODEM) {
    return false;
  }

  if (!WiFi.STA.started()) {
    _sleepEnabled = sleepType;
    return true;
  }

  esp_err_t err = esp_wifi_set_ps(sleepType);
  if (err != ESP_OK) {
    log_e("esp_wifi_set_ps failed!: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }

  _sleepEnabled = sleepType;
  return true;
}

/**
 * Get WiFi modem power save mode
 * @return wifi_ps_type_t
 */
wifi_ps_type_t WiFiGenericClass::getSleep() {
  return _sleepEnabled;
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 2)
/**
 * control wifi band mode
 * @param band_mode enum possible band modes
 * @return ok
 */
bool WiFiGenericClass::setBandMode(wifi_band_mode_t band_mode) {
#if SOC_WIFI_SUPPORT_5G
  if (!WiFi.STA.started() && !WiFi.AP.started()) {
    log_e("You need to start WiFi first");
    return false;
  }
  wifi_band_mode_t bm = WIFI_BAND_MODE_AUTO;
  esp_err_t err = esp_wifi_get_band_mode(&bm);
  if (err != ESP_OK) {
    log_e("Failed to get Current Band Mode: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  } else if (bm == band_mode) {
    log_d("No change in Band Mode");
    return true;
  } else {
    log_d("Switching Band Mode from %d to %d", bm, band_mode);
  }
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_ERROR
  if (WiFi.STA.connected() || WiFi.AP.connected()) {
    log_e("Your network will get disconnected!");
  }
#endif
  err = esp_wifi_set_band_mode(band_mode);
  if (err != ESP_OK) {
    log_e("Failed to set Band Mode: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  delay(100);
  return true;
#else
  if (band_mode == WIFI_BAND_MODE_5G_ONLY) {
    log_e("This chip supports only 2.4GHz WiFi");
  }
  return band_mode != WIFI_BAND_MODE_5G_ONLY;
#endif
}

/**
 * get the current enabled wifi band mode
 * @return enum band mode
 */
wifi_band_mode_t WiFiGenericClass::getBandMode() {
#if SOC_WIFI_SUPPORT_5G
  wifi_band_mode_t band_mode = WIFI_BAND_MODE_AUTO;
  if (!WiFi.STA.started() && !WiFi.AP.started()) {
    log_e("You need to start WiFi first");
    return band_mode;
  }
  esp_err_t err = esp_wifi_get_band_mode(&band_mode);
  if (err != ESP_OK) {
    log_e("Failed to get Band Mode: 0x%x: %s", err, esp_err_to_name(err));
  }
  return band_mode;
#else
  return WIFI_BAND_MODE_2G_ONLY;
#endif
}
#endif

/**
 * get the current active wifi band
 * @return enum band
 */
wifi_band_t WiFiGenericClass::getBand() {
#if SOC_WIFI_SUPPORT_5G
  wifi_band_t band = WIFI_BAND_2G;
  if (!WiFi.STA.started() && !WiFi.AP.started()) {
    log_e("You need to start WiFi first");
    return band;
  }
  esp_err_t err = esp_wifi_get_band(&band);
  if (err != ESP_OK) {
    log_e("Failed to get Band: 0x%x: %s", err, esp_err_to_name(err));
  }
  return band;
#else
  return WIFI_BAND_2G;
#endif
}

/**
 * control wifi tx power
 * @param power enum maximum wifi tx power
 * @return ok
 */
bool WiFiGenericClass::setTxPower(wifi_power_t power) {
  if (!WiFi.STA.started() && !WiFi.AP.started()) {
    log_w("Neither AP or STA has been started");
    return false;
  }
  esp_err_t err = esp_wifi_set_max_tx_power(power);
  if (err != ESP_OK) {
    log_e("Failed to set TX Power: 0x%x: %s", err, esp_err_to_name(err));
  }
  return err == ESP_OK;
}

wifi_power_t WiFiGenericClass::getTxPower() {
  int8_t power;
  if (!WiFi.STA.started() && !WiFi.AP.started()) {
    log_w("Neither AP or STA has been started");
    return WIFI_POWER_19_5dBm;
  }
  esp_err_t err = esp_wifi_get_max_tx_power(&power);
  if (err != ESP_OK) {
    log_e("Failed to get TX Power: 0x%x: %s", err, esp_err_to_name(err));
    return WIFI_POWER_19_5dBm;
  }
  return (wifi_power_t)power;
}

/**
 * Initiate FTM Session.
 * @param frm_count Number of FTM frames requested in terms of 4 or 8 bursts (allowed values - 0(No pref), 16, 24, 32, 64)
 * @param burst_period Requested time period between consecutive FTM bursts in 100's of milliseconds (allowed values - 0(No pref), 2 - 255)
 * @param channel Primary channel of the FTM Responder
 * @param mac MAC address of the FTM Responder
 * @return true on success
 */
bool WiFiGenericClass::initiateFTM(uint8_t frm_count, uint16_t burst_period, uint8_t channel, const uint8_t *mac) {
  wifi_ftm_initiator_cfg_t ftmi_cfg = {
    .resp_mac = {0, 0, 0, 0, 0, 0}, .channel = channel, .frm_count = frm_count, .burst_period = burst_period, .use_get_report_api = true
  };
  if (mac != NULL) {
    memcpy(ftmi_cfg.resp_mac, mac, 6);
  }
  // Request FTM session with the Responder
  esp_err_t err = esp_wifi_ftm_initiate_session(&ftmi_cfg);
  if (ESP_OK != err) {
    log_e("Failed to initiate FTM session: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  return true;
}

/**
 * Configure Dual antenna.
 * @param gpio_ant1 Configure the GPIO number for the antenna 1 connected to the RF switch (default GPIO2 on ESP32-WROOM-DA)
 * @param gpio_ant2 Configure the GPIO number for the antenna 2 connected to the RF switch (default GPIO25 on ESP32-WROOM-DA)
 * @param rx_mode Set the RX antenna mode. See wifi_rx_ant_t for the options.
 * @param tx_mode Set the TX antenna mode. See wifi_tx_ant_t for the options.
 * @return true on success
 */
bool WiFiGenericClass::setDualAntennaConfig(uint8_t gpio_ant1, uint8_t gpio_ant2, wifi_rx_ant_t rx_mode, wifi_tx_ant_t tx_mode) {
#if !CONFIG_ESP_WIFI_REMOTE_ENABLED

  esp_phy_ant_gpio_config_t wifi_ant_io;

  esp_err_t err = esp_phy_get_ant_gpio(&wifi_ant_io);
  if (ESP_OK != err) {
    log_e("Failed to get antenna configuration: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }

  wifi_ant_io.gpio_cfg[0].gpio_num = gpio_ant1;
  wifi_ant_io.gpio_cfg[0].gpio_select = 1;
  wifi_ant_io.gpio_cfg[1].gpio_num = gpio_ant2;
  wifi_ant_io.gpio_cfg[1].gpio_select = 1;

